#!/bin/bash
#工作路径
DATA_DIR=/root/youxuan/
#####################################################################################################
#TG推送设置
#TG机器人token 例如：123456789:ABCDEFG...
telegramBotToken=x:x
#用户ID或频道、群ID 例如：123456789
telegramBotUserId=x
#####################################################################################################
#企业微信推送设置
#替换 YOUR_WEBHOOK_URL 为机器人的实际 Webhook 地址
WEBHOOK_URL="https://qyapi.weixin.qq.com/cgi-bin/webhook/send?key=xx"
#####################################################################################################
#DnsPod域名更新配置
#生成的loginToken填入此处
login_token="x,x"
#域名
domain="x.com.cn"
#子域名，如果是主域名，将其设置为 "@"
sub_domain="x"
#解析类型，A为ipv4,AAAA为ipv6
record_type="A"
#####################################################################################################

#定义passwall节点名称
passwallnode=KzcTYlkf
#定义passwall进程
CLIEN=passwall
#####################################################################################################
#测速地址  
CFST_URL=https://speed.cloudflare.com/__down?bytes=200000000
#指定测速端口；延迟测速/下载测速时使用的端口；(默认 443 端口)
CFST_port=2096
#平均延迟上限；只输出低于指定平均延迟的 IP，各上下限条件可搭配使用；(默认 9999 ms)
CFST_tl=200
#平均延迟下限；只输出高于指定平均延迟的 IP；(默认 0 ms)
CFST_tll=40
#下载速度下限；只输出高于指定下载速度的 IP，凑够指定数量 [-dn] 才会停止测速；(默认 0.00 MB/s)
CFST_sl=5
#下载测速数量；延迟测速并排序后，从最低延迟起下载测速的数量；(默认 10 个)
CFST_dn=50
#显示结果数量；测速后直接显示指定数量的结果，为 0 时不显示结果直接退出；(默认 10 个)
CFST_p=30
#IP段数据文件；如路径含有空格请加上引号；支持其他 CDN IP段；(默认 ip.txt)
CFST_f=ip.txt
#写入结果文件；如路径含有空格请加上引号；值为空时不写入文件 [-o ""]；(默认 result.csv)
CFST_o=result.csv
#####################################################################################################
#解压缩文件获取的特定文件名
txtfile=45102-1-2096.txt
#####################################################################################################
#IP段数据文件下载最大重试次数
max_retries=5
retries=0
#####################################################################################################
# 设置测试url用的代理服务器地址和端口
proxy_server="127.0.0.1:1081"
url_website="www.google.com"
# 设置url测试次数上限
url_max_retries=10
url_retry_count=0